
Функция СведенияОВнешнейОбработке() Экспорт
ПараметрыРегистрации = Новый Структура;
МассивНазначений = Новый Массив;
МассивНазначений.Добавить("Справочник.ФизическиеЛица");//Указываем документ к которому делаем внешнюю печ. форму
ПараметрыРегистрации.Вставить("Вид", "ПечатнаяФорма"); //может быть -ПечатнаяФорма, ЗаполнениеОбъекта, ДополнительныйОтчет,СозданиеСвязанныхОбъектов...
ПараметрыРегистрации.Вставить("Назначение", МассивНазначений);
ПараметрыРегистрации.Вставить("Наименование", "СправкаСМестаРаботы"); //имя под которым обработка будет зарегестрирована всправочнике внешних обработок
ПараметрыРегистрации.Вставить("БезопасныйРежим", Истина);
ПараметрыРегистрации.Вставить("Версия", "2.2.2.0");
ПараметрыРегистрации.Вставить("Информация", "Эту ВПФ мы сделали длятого что бы посмотреть возможности БСП ");
ТаблицаКоманд = ПолучитьТаблицуКоманд();
ДобавитьКоманду(ТаблицаКоманд, "СправкаСМестаРаботы", "СправкаСМестаРаботы", "ВызовСерверногоМетода", ложь, "ПечатьMXL");
ПараметрыРегистрации.Вставить("Команды", ТаблицаКоманд);
Возврат ПараметрыРегистрации;
КонецФункции

Функция ПолучитьТаблицуКоманд() Экспорт
Команды = Новый ТаблицаЗначений;
Команды.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));//как будет выглядеть описание печ.формы для пользователя
Команды.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка")); //имя макета печ.формы
Команды.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка")); //ВызовСерверногоМетода
Команды.Колонки.Добавить("ПоказыватьОповещение", Новый ОписаниеТипов("Булево"));
Команды.Колонки.Добавить("Модификатор", Новый ОписаниеТипов("Строка"));
Возврат Команды;
КонецФункции 

Процедура ДобавитьКоманду(ТаблицаКоманд, Представление,Идентификатор, Использование, ПоказыватьОповещение = Ложь,Модификатор = "") экспорт
НоваяКоманда = ТаблицаКоманд.Добавить();
НоваяКоманда.Представление = Представление;
НоваяКоманда.Идентификатор = Идентификатор;
НоваяКоманда.Использование = Использование;
НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение;
НоваяКоманда.Модификатор = Модификатор;
КонецПроцедуры 

Процедура Печать(МассивОбъектов, КоллекцияПечатныхФорм,ОбъектыПечати, ПараметрыВывода) Экспорт
УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "СправкаСМестаРаботы", "СправкаСМестаРаботы",СформироватьПечатнуюФорму(МассивОбъектов[0], ОбъектыПечати));
КонецПроцедуры

Функция СформироватьПечатнуюФорму(СсылкаСотрудник,ОбъектыПечати)Экспорт
	ТабДок = Новый ТабличныйДокумент;
	   	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ФизическиеЛица.Наименование КАК ФИОСотрудника,
		|	ФизическиеЛица.ИНН КАК ИНН
		|ИЗ
		|	Справочник.ФизическиеЛица КАК ФизическиеЛица
		|ГДЕ
		|	ФизическиеЛица.Ссылка = &СсылкаСотрудник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОтветственныеЛицаОрганизаций.Наименование КАК ИмяРуководителя,
		|	ОтветственныеЛицаОрганизаций.Должность КАК Должность
		|ИЗ
		|	Справочник.ОтветственныеЛицаОрганизаций КАК ОтветственныеЛицаОрганизаций
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Организации.ИНН КАК ИННОрганизвции,
		|	Организации.НаименованиеСокращенное КАК НаименованиеОрганизации
		|ИЗ
		|	Справочник.Организации КАК Организации
		|ГДЕ
		|	Организации.ИНН <> """"
		|	И Организации.НаименованиеСокращенное <> """"";
		
	
	Запрос.УстановитьПараметр("СсылкаСотрудник", СсылкаСотрудник);
	
	
	Выборка = Запрос.ВыполнитьПакет();
	
	Запрос1 = Выборка[0];
	Запрос2 = Выборка[1];
	Запрос3 = Выборка[2];
	РезультатСотрудник = Запрос1.Выбрать();
	РезультатРуководитель = Запрос2.Выбрать();
	РезультатОрганизация = Запрос3.Выбрать();
	РезультатСотрудник.Следующий();
	РезультатРуководитель.Следующий();
	РезультатОрганизация.Следующий();
	
	Макет = ПолучитьМакет("Справка");
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьТекст = Макет.ПолучитьОбласть("Текст");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	
	
	ОбластьЗаголовок.Параметры.НаименованиеОрганизации = РезультатОрганизация.НаименованиеОрганизации;
	ОбластьЗаголовок.Параметры.Дата = Формат(ТекущаяДата(),"ДЛФ=D");
	ОбластьЗаголовок.Параметры.ИННОрганизации = РезультатОрганизация.ИННОрганизвции;
	ТабДок.Вывести(ОбластьЗаголовок);
	
	ОбластьТекст.Параметры.Сотрудник = РезультатСотрудник.ФИОСотрудника;
	ОбластьТекст.Параметры.ИНН = РезультатСотрудник.ИНН;
	ОбластьТекст.Параметры.НаименованиеОрганизации = РезультатОрганизация.НаименованиеОрганизации;
	ТабДок.Вывести(ОбластьТекст);
	
	ОбластьПодвал.Параметры.ДолжностьРуководителя = РезультатРуководитель.Должность;
	ОБластьПодвал.Параметры.Руководитель = РезультатРуководитель.ИмяРуководителя;;
	ТабДок.Вывести(ОбластьПодвал);
	
	ВставлятьРазделительСтраниц = Истина;
	ТабДок.АвтоМасштаб = Истина;
	

	Возврат ТабДок;
КонецФункции